# name
"""
    3) Напишите программу, которая на входе получает имя пользователя,
    cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
"""
name = input("Enter your name: ")
print(f"Hello {name}!")

# math
"""
4) Напишите программу, которая на входе получает 2 числа,
производит с ними арифметическую операцию(на ваше усмотрение),
и выводит “Результат = {результат}”.
"""
number_1 = input("Enter the 1st number: ")
number_2 = input("Enter the 2d number: ")
summ = int(number_1) + int(number_2)
print("Summ is: " + str(summ))

# test