# Создайте файл my_calc.py и пропишите в нем минимум 4 функции,
# выполняющие базовые арифметические вычисления.
#      Примените эти функции в качестве методов в другом файле.

import arithmetical_operations

print(arithmetical_operations.addition(3,2))
print(arithmetical_operations.subtraction(3,2))
print(arithmetical_operations.multiplication(3,2))
print(arithmetical_operations.dividing(3,2))