# Напишите программу, которая проверяет является ли
# введенное число четным. Если да, выведите на экран
# текст “Четное”, а иначе - “Нечетное”

x = int(input())
if x % 2 == 0:
    print("ч")
else:
    print("неч")